{
  "steps": [
    {
      "number": 1,
      "type": "idea",
      "instructions": [
        "Based on the main task's focus on high-income private equity customers, generate 5 distinct research project ideas.",
        "Each idea should propose a unique angle for analysis, considering customer metrics, economic stress, clustering, and behavioral correlations.",
        "Ensure the ideas are ambitious and could lead to significant insights regarding risk management, customer segmentation, or investment strategies."
      ],
      "assigned_agent": "idea_maker",
      "description": "Generate 5 new research project ideas related to the datasets and the main task of analyzing high-income customer behavior during economic stress."
    },
    {
      "number": 2,
      "type": "idea",
      "instructions": [
        "Review the 5 research ideas generated by the idea_maker.",
        "For each idea, provide a critical analysis highlighting potential flaws, methodological challenges, lack of novelty, or impracticality.",
        "Focus on identifying weaknesses that would hinder the successful completion or impact of the research."
      ],
      "assigned_agent": "idea_hater",
      "description": "Critically evaluate the 5 research project ideas to identify their weaknesses and potential pitfalls."
    },
    {
      "number": 3,
      "type": "idea",
      "instructions": [
        "Analyze the critiques provided by the idea_hater for all 5 ideas.",
        "Select the 2 ideas that show the most promise despite the criticisms.",
        "Revise and improve these 2 selected ideas to directly address the identified weaknesses, for example, by narrowing the scope, proposing alternative methods, or clarifying the hypothesis."
      ],
      "assigned_agent": "idea_maker",
      "description": "Select and improve 2 out of the 5 research project ideas, taking into account the critiques from the idea_hater."
    },
    {
      "number": 4,
      "type": "idea",
      "instructions": [
        "Review the 2 improved research ideas.",
        "Assess whether the revisions have adequately addressed the initial critiques.",
        "Provide a final, in-depth critique for each of the 2 ideas, pointing out any remaining flaws or areas for improvement."
      ],
      "assigned_agent": "idea_hater",
      "description": "Perform a second round of critique on the 2 improved and refined research ideas."
    },
    {
      "number": 5,
      "type": "idea",
      "instructions": [
        "Consider the final critiques on the 2 improved ideas.",
        "Select the single best research idea that is the most robust, feasible, and has the highest potential for impact.",
        "Provide a brief justification for the selection, explaining why it is superior to the other option."
      ],
      "assigned_agent": "idea_maker",
      "description": "Select the single best and most viable research idea from the two improved options."
    },
    {
      "number": 6,
      "type": "idea",
      "instructions": [
        "Take the final selected research idea.",
        "Formulate a concise and impactful scientific paper title that captures the essence of the research.",
        "Write a 5-sentence description that outlines the research question, methodology, expected outcomes, and overall significance."
      ],
      "assigned_agent": "idea_maker",
      "description": "Report the best idea in the form of a scientific paper title and a 5-sentence descriptive abstract."
    }
  ],
  "summary": "This plan outlines a structured, six-step process for generating and refining a research idea focused on analyzing the behavior of high-income private equity customers. It leverages a collaborative-adversarial approach between an 'idea_maker' and an 'idea_hater' to brainstorm, critique, and progressively improve ideas. The final output is a single, well-defined research project, presented as a scientific paper title and description, ready for further development."
}