{
  "steps": [
    {
      "number": 1,
      "type": "research",
      "instructions": [
        "首先，仔细解读项目摘要，识别出研究的核心问题：‘与统一干预相比，根据学生特定短板“对症下药”的诊断-匹配策略能在多大程度上提升干预效果？’",
        "基于此问题，提炼出本次模拟研究需要验证的核心假设。例如：‘在低成就学生群体中，采用诊断-匹配干预策略所带来的学业成就增益，其效应量显著大于采用通用干预策略。’",
        "明确模型得以成立的几个关键前提条件，这些条件源于摘要中的描述：1) 学生成就由潜在的知识与动机双重因素决定；2) 存在交互效应，即技能干预的效果受动机水平调节；3) 低成就学生可根据其主要短板（知识、动机或两者兼有）进行分类。"
      ],
      "assigned_agent": "researcher",
      "description": "解构研究问题与假设：将项目创意中的核心思想转化为具体、可供验证的研究假设和明确的模型前提条件，为后续方法设计奠定理论基础。"
    },
    {
      "number": 2,
      "type": "research",
      "instructions": [
        "为学生成就（Achievement, A）构建一个数学函数，该函数以知识（Knowledge, K）和动机（Motivation, M）为输入变量。例如，可以设定为 A = f(K, M) = α*K + β*M。",
        "为“交互效应”建立数学表达。具体来说，当施加“技能干预”时，知识的变化量（ΔK）应是动机（M）的函数。例如，ΔK_skill = base_effect * (1 + γ*M)，其中γ为调节系数。",
        "定义其他干预类型的数学效果。例如，“动机干预”直接增加动机值（ΔM_motivation = constant），而“通用干预”则可能对K和M产生较小的、固定的增益。",
        "明确所有模型参数（如α, β, γ, base_effect等）的含义和角色。"
      ],
      "assigned_agent": "researcher",
      "description": "定义模拟模型的数学框架：将概念模型（知识、动机、成就、干预）转化为精确的数学方程和参数，构建“因材施教”增益得以涌现的内在机制。"
    },
    {
      "number": 3,
      "type": "research",
      "instructions": [
        "设定模拟的总学生人数（N），例如 N=10000。",
        "定义生成初始知识（K）和动机（M）分数所用的概率分布。例如，假设K和M均服从均值为0、标准差为1的正态分布，K ~ N(0, 1), M ~ N(0, 1)。考虑两者之间是否应存在相关性。",
        "根据步骤二中定义的成就函数，计算每位学生的初始成就分数（A_pre）。",
        "确立“低成就学生”的筛选标准。例如，将初始成就分数排在后20%（即bottom quintile）的学生定义为低成就学生。",
        "在低成就学生群体内部，进一步设计分类规则，以区分“知识短板型”、“动机短板型”和“混合短板型”学生。例如，基于K和M相对于该群体均值的标准差进行划分。"
      ],
      "assigned_agent": "researcher",
      "description": "设计模拟总体与子群体的生成流程：详细说明如何生成一个具有异质性的虚拟学生总体，并从中精确识别出目标研究对象——“低成就学生”及其不同类型的亚群。"
    },
    {
      "number": 4,
      "type": "research",
      "instructions": [
        "定义一个不接受任何干预的“控制组”。",
        "设计“通用干预”（一刀切模式）条件：所有接受该干预的学生，其K和M均获得一个固定的、较小的提升。",
        "设计“诊断-匹配干预”条件：对识别出的低成就学生“对症下药”。对“知识短板型”学生施加“技能干预”；对“动机短板型”学生施加“动机干预”；对“混合短板型”学生施加两种干预的组合。",
        "为便于比较，可以额外设置纯“技能干预”组和纯“动机干预”组，即将单一干预应用于所有低成就学生，以凸显“匹配”的价值。",
        "明确分配机制：低成就学生将被随机分配到上述不同干预条件组中，以进行后续比较。"
      ],
      "assigned_agent": "researcher",
      "description": "规划实验条件与干预方案：明确本次模拟实验将包含的各个处理组（如控制组、通用干预组、诊断-匹配组），并精确定义每种干预方案在模型中的具体操作方式。"
    },
    {
      "number": 5,
      "type": "research",
      "instructions": [
        "定义核心因变量：学生的“成就增益”（Gain Score），计算公式为 Gain = A_post - A_pre，其中A_post为干预后成就。",
        "定义关键评价指标：“匹配增益”（Matching Gain），其量化方式为“诊断-匹配组”的平均成就增益与“通用干预组”的平均成就增益之差。",
        "选择合适的效应量（Effect Size）指标，如科恩的d（Cohen's d），用于量化和比较不同干预组别之间成就增益的差异程度。",
        "规划统计分析方法：计划采用独立样本t检验或单因素方差分析（ANOVA）来检验不同干预组之间平均成就增益的差异是否具有统计显著性。",
        "构思所需的可视化图表：1) 初始学生群体的知识-动机二维散点图，用颜色区分低成就学生。2) 对比低成就学生在不同干预条件下（控制、通用、诊断-匹配）平均成就增益的条形图或箱线图。"
      ],
      "assigned_agent": "researcher",
      "description": "确定结果衡量指标与分析策略：规定用于评估干预效果的核心指标（如成就增益、匹配增益）、统计分析方法以及最终用于呈现结果的可视化图表类型。"
    },
    {
      "number": 6,
      "type": "research",
      "instructions": [
        "创建一个文档，标题为“研究方法”。",
        "根据前序步骤（1-5）的规划，撰写方法论的各个子章节，建议包含：‘模型设定与假设’、‘模拟数据生成’、‘实验设计与干预流程’、‘数据分析与评价指标’。",
        "在‘模型设定与假设’章节中，整合步骤1和2的内容，清晰陈述模型的数学原理和核心假设。",
        "在‘模拟数据生成’章节中，详细描述步骤3中定义的总体生成、低成就学生筛选和分类的具体参数与流程。",
        "在‘实验设计与干预流程’章节中，依据步骤4的规划，说明实验分组情况和每种干预措施的具体内容。",
        "在‘数据分析与评价指标’章节中，依据步骤5的规划，明确研究所用的因变量、评价指标、统计检验方法和图表类型。",
        "通读并修订全文，确保描述精确、逻辑连贯，使其他研究者能够根据此方法论完整复现本研究。"
      ],
      "assigned_agent": "researcher",
      "description": "撰写完整的研究方法论章节：综合前述所有规划步骤，系统性地撰写一份结构完整、内容详尽的研究方法论文档，作为最终研究报告的核心组成部分。"
    }
  ],
  "summary": "本研究计划旨在为“因材施教的增益”模拟实验制定一套严谨的研究方法。计划共分六个步骤：首先解构研究问题与假设；其次定义模拟模型的数学框架；接着设计模拟总体与子群体的生成流程；然后规划实验条件与干预方案；之后确定结果衡量指标与分析策略；最后，综合所有信息，撰写一份完整的、可复现的研究方法论章节。整个计划严格聚焦于方法论的构建，确保每一步都具体、可行，并服务于最终的模拟实验目标。"
}