{
  "steps": [
    {
      "number": 1,
      "type": "idea",
      "instructions": [
        "基于核心任务（通过模拟证明干预对低成就学生效应量更大），生成5个可以利用类似模拟数据集进行探索的、具体且新颖的研究项目创意。",
        "创意应超越核心任务，探索不同的变量、机制或背景。例如，可以考虑干预成本效益、不同类型的干预措施、或是“低成就”定义本身的敏感性分析。",
        "确保每个创意都足够独特，可以作为一个独立的研究项目。",
        "为每个创意提供一个简短的标题和2-3句话的描述。"
      ],
      "assigned_agent": "idea_maker",
      "description": "生成5个与“教育干预对不同学生群体的差异化效应”相关的原创研究项目创意，作为后续筛选和深化的基础。"
    },
    {
      "number": 2,
      "type": "idea",
      "instructions": [
        "针对 idea_maker 提出的5个创意，从研究新颖性、可行性、潜在影响力和逻辑严谨性等方面进行批判性评估。",
        "明确指出每个创意可能存在的缺陷、过于简化的假设或潜在的挑战。",
        "例如，某个创意是否难以在模拟中有效操作？其结论是否可能显而易见或缺乏现实意义？",
        "对每个创意给出“保留并改进”、“可合并”或“建议放弃”的明确建议，并说明理由。"
      ],
      "assigned_agent": "idea_hater",
      "description": "对初步生成的5个研究创意进行严格的批判性评审，识别其优缺点，并为下一阶段的筛选提供决策依据。"
    },
    {
      "number": 3,
      "type": "idea",
      "instructions": [
        "仔细分析 idea_hater 的评审意见。",
        "根据评审建议，从5个创意中挑选出2个最具潜力的进行深化和改进。",
        "针对 idea_hater 指出的具体缺陷，对这2个创意进行修改，使其研究问题更聚焦、模拟假设更合理、潜在贡献更清晰。",
        "清晰地阐述每个改进后的创意相比原版的提升之处。"
      ],
      "assigned_agent": "idea_maker",
      "description": "根据 idea_hater 的批判性反馈，筛选并改进2个最有前景的研究创意，使其更具深度和可行性。"
    },
    {
      "number": 4,
      "type": "idea",
      "instructions": [
        "对 idea_maker 改进后的2个创意进行最终的、更深入的批判性评审。",
        "比较这两个创意，评估哪个在研究问题的前沿性、模拟设计的巧妙性以及潜在的理论或实践贡献方面更胜一筹。",
        "指出每个方案仍然存在的风险或可以进一步完善的地方。",
        "最终给出一个明确的建议，指出哪个创意作为最优方案更合适，并提供简要的最终理由。"
      ],
      "assigned_agent": "idea_hater",
      "description": "对两个经过改进的创意进行最终的比较和评审，旨在确定单一的最佳方案。"
    },
    {
      "number": 5,
      "type": "idea",
      "instructions": [
        "综合考量 idea_hater 在第二轮评审中对两个改进后创意的最终评估和建议。",
        "在两个备选方案中做出最终决定，选择一个作为本次研究计划的最优项目创意。",
        "用一句话简要说明做出此选择的决定性理由（例如，“此方案在理论创新上更具突破性”或“此方案与现实教育问题的关联更紧密”）。"
      ],
      "assigned_agent": "idea_maker",
      "description": "在两个精炼后的创意中，根据最终评审意见，选定最终的、最优的研究项目方案。"
    },
    {
      "number": 6,
      "type": "idea",
      "instructions": [
        "为最终选定的最优方案构思一个精确且具吸引力的科学论文标题。",
        "撰写一段5句话左右的简要描述（类似论文摘要），清晰地概括研究背景、核心问题、研究方法（模拟实验）、预期发现及其意义。",
        "确保标题和描述能够准确、专业地传达该研究项目的核心价值。"
      ],
      "assigned_agent": "idea_maker",
      "description": "将最终选定的最优方案包装成一个正式的科学论文标题和简要描述，作为整个创意生成阶段的最终成果。"
    }
  ],
  "summary": "本研究计划旨在通过一个六步流程，系统性地生成、评审并筛选出一个关于“教育干预对低成就学生差异化效应”的高质量研究项目创意。计划从创意发散开始，通过 idea_maker 和 idea_hater 的多轮互动，对创意进行批判、改进和聚焦，最终产出一个以科学论文标题和摘要形式呈现的、具体且有价值的研究方案，为后续的模拟实验提供清晰的指引。"
}